//Теория
// var arr = ['пн','вт','ср','чт','пт','сб','вс']; // Создаем массив arr с названиями днями недели

// var arr = ["пн", 256, "ср", 34, 38, "сб", 95]; // Создали масив с числами, числа в кавычки не берем - только строки.

// Выведем слово 'ср':
/*
var arr = ["пн", "вт", "ср", "чт", "пт", "сб", "вс"];
alert(arr[2]); 
*/

// Укажем ключи в явном виде:
/*
 var obj = {
    1: 'пн',
    2: 'вт',
    3: 'ср',
    4: 'чт',
    5: 'пт',
    6: 'сб',
    7: 'вс'
};
alert(obj[1]); // выведет 'пн'
*/

/*
 var obj = { 1: "пн", 2: "вт", 3: "ср", 4: "чт", 5: "пт", 6: "сб", 7: "вс" };
alert(obj[1]); //выведет 'пн'
*/

// Массив (объект) работников:
/* var obj = { Коля: 200, Вася: 300, Петя: 400 };
 alert(obj["Вася"]); */

//Кавычки вокруг строковых ключей можно и не ставить, но лучше всегда брать в кавычки
/*
var obj = { key1: 200, key2: 300, key3: 400 };
alert(obj["key1"]); */

// При обращении через точку говорят - обращаемся к свойству объекта
/* var obj = { key1: 200, key2: 300, key3: 400 };
alert(obj.key1); */

// ругается на синтаксиси - не отрабатывает
// var obj = new Object(key1: 200, key2: 300, key2: 400);
// alert(obj['key1']); //выведет 200

// var arr = Array("пн", 256, "ср", 34, 37, "сб", 95);
// alert(arr["2"]);

// Массив из одного элемента 10
// var arr = Array(10);

// 10 пустых массивов со значением undefined
// var arr = [10];
// эквивалент var arr = [,,,,,,,,,];

// var arr = [];
// arr[0] = 1;
// arr[1] = 2;
// arr[2] = 3;
// alert(arr);

// var obj = {};
// obj["Коля"] = 100;
// obj["Вася"] = 200;
// obj["Петя"] = 300;

//многомерный массив студентов:
// var students = {
//   boys: ["Коля", "Вася", "Петя"],
//   girls: ["Даша", "Маша", "Лена"],
// };
// alert(students["boys"][0]);

// Задача 1
// Выведем фразу 'Привет мир!':
// var arr = ["Привет, ", "мир", "!"];
// alert(arr[0] + arr[1] + arr[2]);

// Задача 2
// Выведем фразу 'Привет мир!' в переменную :
// var arr = ["Привет, ", "мир", "!"];
// var str = arr[0] + arr[1] + arr[2];
// alert(str);

// Задача 3 Заменить в массиве привет на пока
// var arr = ["Привет", "мир", "!"];
// arr[0] = "Пока";
// alert(arr);

// Задача 4
// var obj = { Коля: "1000", Вася: "500", Петя: "200" };
// alert(obj["Коля"] + "," + obj["Петя"]);

// Задача 5
// var arr = [1, 2, 3, 4, 5];
// //Второй способ
// var arr = [];
// arr[0] = 1;
// arr[1] = 2;
// arr[2] = 3;
// arr[3] = 4;
// arr[4] = 5;

// Задача 6
// var arr = {
//   ru: ["голубой", "красный", "зеленый"],
//   en: ["blue", "red", "green"],
// };
// alert(arr["ru"][0]);

// Самостоятельные задачи
// #1
// var arr = ["a", "b", "c"];
// alert(arr);

// #2
// var arr = ["a", "b", "c"];
// alert(arr[0]);
// alert(arr[1]);
// alert(arr[2]);

// #3
// var arr = ["a", "b", "c", "d"];
// alert(arr[0] + "+" + arr[1] + ", " + arr[2] + "+" + arr[3]);

// #4
// var arr = [2, 5, 3, 9];
// result = arr[0] * arr[1] + arr[2] * arr[3];
// alert(result);

// #5
// var obj = { a: 1, b: 2, c: 3 };
// alert(obj["c"]);
// alert(obj.c);

// #6
// var obj = { Коля: "1000", Вася: "500", Петя: "200" };
// alert(obj["Петя"] + "," + obj["Коля"]);

// #7
// var obj = { 1: "пн", 2: "вт", 3: "ср", 4: "чт", 5: "пт", 6: "сб", 7: "вс" };
// alert(obj[6]);

// #8
// var obj = { 1: "пн", 2: "вт", 3: "ср", 4: "чт", 5: "пт", 6: "сб", 7: "вс" };
// var day = obj[6];
// alert(day);

// #9
// var arr = [
//   [1, 2, 3],
//   [4, 5, 6],
//   [7, 8, 9],
// ];
// alert(arr[1][0]);

// #10
// var obj = { js: ["jQuery", "Angular"], php: "hello", css: "world" };
// alert(obj["js"][0]);

// #11
// var arr = {
//   рус: ["пн", "вт", "ср", "чт", "пт", "сб", "вс"],
//   en: ["pn", "vt", "cr", "zt", "pt", "cb", "bc"],
// };
// alert(arr["рус"][0] + " " + arr["en"][2]);

// #12
// var lang = ["ru", "en"];
// var day = [
//   "пн",
//   "вт",
//   "ср",
//   "чт",
//   "пт",
//   "сб",
//   "вс",
//   "pn",
//   "vt",
//   "cr",
//   "zt",
//   "pt",
//   "cb",
//   "bc",
// ];
// alert(lang[0] + " " + day[5]);
